/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2020 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "adc.h"
#include "dma.h"
#include "i2c.h"
#include "rtc.h"
#include "spi.h"
#include "tim.h"
#include "usart.h"
#include "gpio.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "cJSON.h"
#include <time.h>
#include "dwt_delay.h"
#include "AM2305.h"
#include "time.h"
#include "ee24.h"
#include "SIM8xx.h"
#include "ssd1306.h"
#include "ssd1306_fonts.h"
#include "current.h"
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */
typedef struct program_t{
/* 0 */	uint8_t ID;
/* 1 */	uint8_t Month;
/* 2 */	uint8_t Day;
/* 3 */	uint8_t Hour;
/* 4 */	uint8_t Minutes;
/* 5 */	uint8_t PeriodDay;
/* 6 */	uint8_t PeriodHour; 
/* 7 */	uint8_t PeriodMinute;
/* 8 */	uint8_t Action[2]; ///////////NEW ADDED/////////////////
/* 9 */	uint8_t has_interval;
} Program;
typedef struct ProcessProgram_t{
/* 0 */	uint8_t  ID;
/* 1 */	uint32_t duration[10];	
/* 2 */	uint8_t  Hour[10];
/* 3 */	uint8_t  Minutes[10];
/* 4 */	uint8_t  Second[10];	
/* 5 */	uint8_t  spouts[10][2]; ///////////NEW ADDED/////////////////
/* 6 */	uint8_t  events_count;	
}
ProcessProgram;

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */

// DEVICE NAME: "ABGIRI"

#define		__SENSORS_ARE_ENABLE__		0																						// If you want to use sensors, this value should be 1.
#define		__BUTTONS_ARE_ENABLE__		1																						// If you want to use external buttons, this value should be 1.
#define		__IS_3G_MODULE__					0																						// If you use 3G module this value should be 1.
#define		__INITIALLIGHT__					0	
#define		__IS_OLED__								0																						// If you use OLED this value should be 1.
#define  	__SERIAL_NUMBER						"12121212001"																// Unique serial number. We use this number to get "land ID" from server.12
#define		__WELCOME_TEXT						"WELCOME"																		// The text sent via SMS after reset.
#define		__ON_OFF_CURRENT_THRESH__	1000	 																			// If the load current (mA) exceeded this limit, it means the load in ON 		

///////////NEW ADDED/////////////////

#define   EE24_WRITE_COEFFICIENT_PROG		 20																		  // a COEFFICIENT used in addresing eeprom
#define   EE24_WRITE_COEFFICIENT_PROS		 100
#define		EE24_START_ADDRESS_PROCESS_PROGRAM 1000	
// The starting address of process programs in eeprom
#define		EE24_START_ADDRESS_PROGRAM 	100																				// The starting address of programs in eeprom
#define		MAX_NUM_PROGRAM 				30
#define		MAX_NUM_PROCESS_EVENT 	10
///////////////////////////////////////

#define		LAST_SYSTEM_RESET_STATUS	  9																					// The address of RTC backup register that using in reset system one time before starting 
#define		PROGRAM_ID_ADDRESS				 19																					// The address of RTC backup register storing the next program ID.
#define		LAST_STATUS_ADDRESS_LSB    15																					// The address of RTC backup register storing the last output status.
#define		LAST_STATUS_ADDRESS_MSB    16																					// The address of RTC backup register storing the last output status.
#define		MY_ID_ADDRESS							 18																					// The address of RTC backup register storing the "Land ID".
#define		PROCESS_PROGRAM_ID_ADDRESS 11																					// The address of RTC backup register storing the last process program ID.
#define		LAST_EVENT_NUMBER_ADDRESS  12																					// The address of RTC backup register storing the last event number of process program .
#define		LAST_CURRENT_TIME_STAMP		 13																					// The address of RTC backup register storing the last current time stamp.
#define		LAST_PROGRAMS_FLAG_STATUS	 14																					// The address of RTC backup register storing the last PROGRAMS flag status.
#define   LAST_EVENT_TIME_STAMP			 17																					// The address of RTC backup register storing the last event time stamp.
//#define		PROCESS_PROG_START_ADD		1000																				// The starting address of process programs in eeprom
#define		debugUART									huart4																			// Debug uart handler
#define		simUART										huart1																			// SIM800 uart handler





#define		SERVER_IP									"baghyar.darkube.app/panel/api/d"										// Server domain
#define 	phone											"+989140436272"	

#define 	U_ID       						    0x1FFF7A10 																	// Unique device ID register address
#define		nmbr_try_connect_site     5																						// Specify how many try to connect to the site
/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/

/* USER CODE BEGIN PV */
typedef struct sTime_t{
/* 0 */	uint16_t year[BUTTONS_NUM];
/* 1 */	uint16_t  month[BUTTONS_NUM];	
/* 2 */	uint16_t  day[BUTTONS_NUM];
/* 3 */	uint16_t  hours[BUTTONS_NUM];
/* 4 */	uint16_t  minutes[BUTTONS_NUM];	
/* 5 */	uint16_t  seconds[BUTTONS_NUM]; 
}
sTime;

uint8_t									isConnect=1;										// Determines the connection status. 1 means connected
uint16_t								deviceId ;											// This is the device ID
uint16_t								landId ;												// This is the landId 
char										ContentStr[size],str[size],oledStr[size];			// Two general strings used in some functions as string buffers
char										SMStext[120];										// The text we want to send
uint32_t								counter;												// Used in flow meter
uint8_t				shomare=0;
RTC_TimeTypeDef					Time;														// Stores time
RTC_DateTypeDef					Date;														// Stores date
RTC_AlarmTypeDef				alarm_struct_A;									// Stores alarm setting
RTC_AlarmTypeDef				alarm_struct_B;									// Stores alarm setting
uint8_t									action = 1;											// This is a flag showing whether we want to send requests to server or not. This value is being changed every 3 minutes

float * 								TH;															// temp & humidity

